app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "body", "created_at", "updated_at", "status") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "123123"], ["body", "2131231222"], ["created_at", "2021-07-21 15:01:55.937172"], ["updated_at", "2021-07-21 15:01:55.937172"], ["status", "public"]]
---
  def create
    @article = Article.new(article_params)

    if @article.save

SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
UPDATE "articles" SET "body" = $1, "updated_at" = $2, "status" = $3 WHERE "articles"."id" = $4  [["body", "good body for article"], ["updated_at", "2021-07-21 15:09:33.177943"], ["status", "public"], ["id", 11]]
---
  def update
    @article = Article.find(params[:id])

    if @article.update(article_params)