app/controllers/comments_controller.rb

SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("commenter", "body", "article_id", "created_at", "updated_at", "status") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["commenter", "12312"], ["body", "12312321"], ["article_id", 14], ["created_at", "2021-07-21 15:02:04.235575"], ["updated_at", "2021-07-21 15:02:04.235575"], ["status", "public"]]
---
    def create
        @article = Article.find(params[:article_id])
        @comment = @article.comments.create(comment_params)